app/Controllers/Home.php

SELECT *
FROM `especialidades`
ORDER BY `nombre_especialidad`
---
    public function index(): string
    {
        $especialidades = new EspecialidadesModel();
        $datos['datos']=$especialidades->orderBy('nombre_especialidad')->findAll();