app/Models/EmpleadosModel.php

SELECT *
FROM `empleados`
WHERE `email` = 'ana.martinez@clinicanorte.com'
 LIMIT 1
---
    public function validacion($email, $contrasena)
    {
        // Busca el empleado por email
        $empleado = $this->where(['email' => $email])->first();