app/Models/MedicosModel.php

    public function especialidadesMedicos($id){
        // Cambia 'tabla_secundaria' y los nombres de columnas según tu esquema
        return $this->db->table('empleados')
            ->join('medicos', 'empleados.id_empleado = medicos.id_empleado')
            ->select('empleados.nombre, empleados.apellido, empleados.telefono, medicos.id_especialidad') // Selecciona las columnas que necesites
            ->where('medicos.id_especialidad',$id)
            ->get()
            ->getResultArray(); // O usa ->getResult() si prefieres objetos
---
SELECT `empleados`.`nombre`, `empleados`.`apellido`, `empleados`.`telefono`, `medicos`.`id_especialidad`
FROM `empleados`
JOIN `medicos` ON `empleados`.`id_empleado` = `medicos`.`id_empleado`
WHERE `medicos`.`id_especialidad` = '1'