app/Controllers/Pacientes/CitamedicaController.php

    public function index(): string
    {
        $citas = new CitasModel();  // Crea una instancia del modelo
        $datos['datos'] = $citas->findAll();  // Obtiene todas las citas
---
SELECT *
FROM `citas`