app/Controllers/Pacientes/PacienteController.php

    public function indexPacientes(): string
    {
        $pacientes = new PacientesModel();
        $datos['datos'] = $pacientes->findAll();
---
SELECT *
FROM `pacientes`

    public function editarPaciente($id_paciente)
    {
        $pacienteModel = new PacientesModel();
        $generoModel = new GenerosModel();
        //Obtener el paciente por el Id de la Bd
        $data['paciente'] = $pacienteModel->find($id_paciente);
        //lista de generos
        $data['generos'] = $generoModel->findAll();
---
SELECT *
FROM `pacientes`
WHERE `pacientes`.`id_paciente` = '3'
SELECT *
FROM `generos`

    public function programarCita()
    {
        // Validar la entrada
        $validation = $this->validate([
            'fecha' => 'required|valid_date',
            'hora' => 'required',
            'doctor' => 'required',
        ]);

        if (!$validation) {
            return redirect()->back()->with('errors', $this->validator->getErrors());
        }

        // Obtener los datos del formulario
        $data = [
            'id_paciente' => session()->get('id_paciente'),
            'fecha_cita' => $this->request->getPost('fecha'),
            'hora' => $this->request->getPost('hora'),
            'id_medico' => $this->request->getPost('doctor'),
            'id_estado' => 1,  // Estado inicial (por ejemplo, "Programada")
            'fecha_creacion' => date('Y-m-d H:i:s'),  // Fecha actual
            'motivo_cita' => $this->request->getPost('motivo'),
        ];
---
SELECT *
FROM `pacientes`
WHERE `pacientes`.`id_paciente` = '1'